<?php

	//問題と解答の設定
	$question_list = array
	(
		"インターネット時間(000～999)",
		"2桁表示の日付",
		"3文字の曜日(Sun～Sat)",
		"フルスペルの月名(January～December)",
		"0埋めしない12時間単位時間",
		"0埋めしない24時間単位時間",
		"2桁表示の12時間単位時間",
		"2桁表示の24時間単位時間",
		"2桁表示の分",
		"0埋めしない日付",
		"フルスペルの曜日(Sunday～Saturday)",
		"閏年かどうかのフラグ",
		"2桁表示の月",
		"3文字で表す月(Jan～Dec)",
		"0埋めしない月",
		"2桁表示の秒",
		"指定した月の日数",
		"数値で示す曜日(0:日～6:土)",
		"IOS-8601 月曜日に始まる年単位の週番号(42:1年の第42週目)",
		"2桁表示の年",
		"4桁表示の年",
		"年間の通算日－1/1からの通算日数(0～366)"
	);

	$answer_list = array
	(
		"B",
		"d",
		"D",
		"F",
		"g",
		"G",
		"h",
		"H",
		"i",
		"j",
		"l",
		"L",
		"m",
		"M",
		"n",
		"s",
		"t",
		"w",
		"W",
		"y",
		"Y",
		"z"
	);
?>